-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Mar 12, 2020 at 01:27 PM
-- Server version: 5.5.62
-- PHP Version: 7.2.7

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `20s2_g4`
--

-- --------------------------------------------------------

--
-- Table structure for table `item`
--

CREATE TABLE `item` (
  `IDs` int(3) NOT NULL,
  `TypeID` int(3) NOT NULL COMMENT 'รหัสประเภท',
  `ItemID` char(30) COLLATE utf8_unicode_ci NOT NULL COMMENT 'รหัสครุภัณฑ์',
  `ItemName` varchar(500) COLLATE utf8_unicode_ci NOT NULL COMMENT 'ชื่อครุภัณฑ์',
  `Detail` varchar(500) COLLATE utf8_unicode_ci DEFAULT NULL COMMENT 'รายละเอียดครุภัณฑ์',
  `Price` int(10) DEFAULT NULL COMMENT 'ราคา/หน่วย',
  `Building` char(11) COLLATE utf8_unicode_ci DEFAULT NULL COMMENT 'ตำแหน่ง',
  `TeacherRight` varchar(100) COLLATE utf8_unicode_ci NOT NULL COMMENT 'สิทธิ์การให้ยืมฐานะอาจารย์',
  `StaffRight` varchar(100) COLLATE utf8_unicode_ci NOT NULL COMMENT 'สิทธิ์การให้ยืมฐานะบุคลากร',
  `StudentRight` varchar(100) COLLATE utf8_unicode_ci NOT NULL COMMENT 'สิทธิ์การให้ยืมฐานะนักศึกษา',
  `Status` varchar(10) COLLATE utf8_unicode_ci NOT NULL COMMENT 'สถานะ',
  `EditDate` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'วันที่แก้ไข',
  `AddDate` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT 'วันที่เพิ่ม',
  `EndDate` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT 'วันที่ลบ'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `item`
--

INSERT INTO `item` (`IDs`, `TypeID`, `ItemID`, `ItemName`, `Detail`, `Price`, `Building`, `TeacherRight`, `StaffRight`, `StudentRight`, `Status`, `EditDate`, `AddDate`, `EndDate`) VALUES
(1, 19, '5602130000087', 'ชุดคอมพิวเตอร์ประมวลผลระดับสูง 1 ชุด', 'Dell Optiplex tx 7010DT', 74900, '', 'อนุญาต', 'อนุญาต', 'ไม่อนุญาต', 'ปกติ', '2020-03-09 14:42:30', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(2, 1, '5602130000116', 'Iphone Edit', 'Ram 2 GB CPUcorei5 570GHz', 18000, '6204', 'อนุญาต', 'อนุญาต', 'ไม่อนุญาต', 'ปกติ', '2020-03-03 13:45:34', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(3, 7, '5602130000209', 'ระบบเชื่อมสัญญาณเครือข่าย(Switching) 1 ชุด', 'Ciscoโอ้ๆๆๆๆๆๆๆๆๆๆ', 599200, '', 'อนุญาต', 'อนุญาต', 'ไม่อนุญาต', 'ปกติ', '2020-03-10 03:39:23', '2020-02-29 17:00:00', '0000-00-00 00:00:00'),
(4, 13, '5602130000007', 'เครื่องทำลายเอกสาร', 'IDEAL 3104', 53500, '', 'อนุญาต', 'อนุญาต', 'อนุญาต', 'ปกติ', '2020-03-03 09:01:52', '2020-02-29 17:00:00', '0000-00-00 00:00:00'),
(5, 13, '5602130000049', 'โปรแกรมวิเคาาห์ข้อมูลสารสนเทศภูมิศาสตร์เชิงพื้นที่', 'ESRI ArcGIS', 219992, 'GIS', 'อนุญาต', 'อนุญาต', 'ไม่อนุญาต', 'ปกติ', '2020-03-03 09:04:55', '2020-02-29 17:00:00', '0000-00-00 00:00:00'),
(6, 13, '5602130000255', 'คอมพิวเตอร์สมมรถนะสูงสำหรับงานวิจัยด้าน IT', '', 1200000, '', 'อนุญาต', 'ไม่อนุญาต', 'ไม่อนุญาต', 'ปกติ', '2020-03-03 09:05:54', '2020-02-29 17:00:00', '0000-00-00 00:00:00'),
(7, 13, '5702130000036', 'เครื่องคอมพิวเตอร์แบบพกพา', '', 799600, '', 'อนุญาต', 'อนุญาต', 'อนุญาต', 'ปกติ', '2020-03-03 09:04:11', '2020-02-29 17:00:00', '0000-00-00 00:00:00'),
(8, 13, '5702130000083', 'ชุดอุปกรณ์สำหรับทำงานด้านวิจัยในวิชาโครงงานนักศึกษา', '', 260000, '', 'อนุญาต', 'อนุญาต', 'อนุญาต', 'ปกติ', '2020-03-03 09:05:18', '2020-02-29 17:00:00', '0000-00-00 00:00:00'),
(9, 13, '5702130000057', 'ระบบคอมพิวเตอร์', '', 1965000, '6324', 'อนุญาต', 'อนุญาติ', 'ไม่อนุญาต', 'ปกติ', '2020-03-03 09:07:44', '2020-02-29 17:00:00', '0000-00-00 00:00:00'),
(10, 13, '5702130000060', 'ระบบเครือข่ายคอมพิวเตอร์', '', 993000, '6324', 'อนุญาต', 'อนุญาต', 'ไม่อนุญาต', 'ปกติ', '2020-03-03 09:07:55', '2020-02-29 17:00:00', '0000-00-00 00:00:00'),
(11, 13, '5702130000086', 'คอมพิวเตอร์ลูกข่ายประสิทธิภาพสูงสำหรับการเรียนการสอนในห้องปฏิบัติการ', '', 2494000, '', 'อนุญาต', 'อนุญาต', 'ไม่อนุญาต', 'ปกติ', '2020-03-03 09:08:06', '2020-02-29 17:00:00', '0000-00-00 00:00:00'),
(12, 13, '5702130000239', 'โปรแกรมประมวลผลภาพทาง GIS', '', 648313, '', 'อนุญาต', 'อนุญาต', 'ไม่อนุญาต', 'ปกติ', '2020-03-03 09:08:34', '2020-02-29 17:00:00', '0000-00-00 00:00:00'),
(13, 13, '5702130000239', 'โปรแกรมประมวลผลภาพทาง GIS', '', 648313, '', 'อนุญาต', 'อนุญาต', 'ไม่อนุญาต', 'ปกติ', '2020-03-03 09:08:54', '2020-02-29 17:00:00', '0000-00-00 00:00:00'),
(14, 13, '5702130000240', 'โปรแกรมประมวลผลข้อมูลการสำรวจระยะไกล', '', 360900, '6707', 'อนุญาต', 'ไม่อนุญาต', 'ไม่อนุญาต', 'ปกติ', '2020-03-03 09:09:10', '2020-02-29 17:00:00', '0000-00-00 00:00:00'),
(15, 13, '5602130000436', 'คอมพิวเตอร์สมมรถนะสูงสำหรับงานวิจัยด้าน IT', '', 549000, '', 'อนุญาต', 'ไม่อนุญาต', 'ไม่อนุญาต', 'ปกติ', '2020-03-03 09:09:32', '2020-02-29 17:00:00', '0000-00-00 00:00:00'),
(16, 13, '5602130000397', 'ระบบเครือข่ายคอมพิวเตอร์', '', 499000, '', 'อนุญาต', 'อนุญาต', 'ไม่อนุญาต', 'ปกติ', '2020-03-03 09:09:46', '2020-02-29 17:00:00', '0000-00-00 00:00:00'),
(17, 13, '5602130000399', 'ชุดอุปกรณ์สำหรับทำงานด้านวิจัยในวิชาโครงงานนักศึกษา', '', 899000, '', 'อนุญาต', 'ไม่อนุญาติ', 'ไม่อนุญาต', 'ปกติ', '2020-03-03 09:09:57', '2020-02-29 17:00:00', '0000-00-00 00:00:00'),
(18, 7, '5602070000048', 'ชุดนำเสนอผลงาน', '', 299900, '', 'อนุญาต', 'อนุญาต', 'อนุญาต', 'ปกติ', '2020-03-03 09:10:06', '2020-02-29 17:00:00', '0000-00-00 00:00:00'),
(19, 13, '5802130000006', 'เครื่องคิมพิวเตอร์แม่ข่าย', '', 88810, '6324', 'อนุญาติ', 'อนุญาติ', 'ไม่อนุญาติ', 'ปกติ', '2020-03-04 07:11:58', '2020-02-29 17:00:00', '0000-00-00 00:00:00'),
(20, 13, '5802130000015', 'ระบบคอมพิวเตอร์', '', 147500, '6324', 'อนุญาต', 'อนุญาต', 'ไม่อนุญาต', 'ปกติ', '2020-03-03 09:17:27', '2020-02-29 17:00:00', '0000-00-00 00:00:00'),
(21, 7, '5802070000025', 'ชุดนำเสนอผลงาน', '', 399800, '', 'อนุญาต', 'อนุญาต', 'อนุญาต', 'ปกติ', '2020-03-03 12:22:33', '2020-02-29 17:00:00', '0000-00-00 00:00:00'),
(103, 13, '5702130000099', 'ชุดคอมพิวเตอร์ประมวลผลระดับสูง 1 ชุด', 'Dell optiplex TM 7010 DT', 599200, '8638', 'ไม่อนุญาต', 'ไม่อนุญาต', 'อนุญาต', 'ปกติ', '2020-03-04 06:46:57', '2020-03-03 17:00:00', '0000-00-00 00:00:00'),
(104, 7, '6102130000087', 'ชุดคอมพิวเตอร์ประมวลผลระดับสูง 1 ชุด', 'Dell optiplex TM 7010 DT', 1, '8504', 'อนุญาต', 'อนุญาต', 'ไม่อนุญาต', 'ปลดระวาง', '2020-03-04 07:46:56', '2020-03-03 17:00:00', '0000-00-00 00:00:00'),
(106, 19, '5602130000097', 'ชุดคอมพิวเตอร์ประมวลผลระดับสูง 1 ชุด', 'Cisco', 749000, '1010', 'ไม่อนุญาต', 'อนุญาต', 'ไม่อนุญาต', 'ซ่อมบำรุง', '2020-03-09 14:42:21', '2020-03-08 17:00:00', '0000-00-00 00:00:00');

-- --------------------------------------------------------

--
-- Table structure for table `type`
--

CREATE TABLE `type` (
  `ID` int(3) NOT NULL DEFAULT '0',
  `TypeName` varchar(60) COLLATE utf8_unicode_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `type`
--

INSERT INTO `type` (`ID`, `TypeName`) VALUES
(0, NULL),
(1, 'อาคารถาวร'),
(2, 'อาคารชั่วคราว/โรงเรียน'),
(3, 'สิ่งก่อสร้าง'),
(4, 'ครุภัณฑ์โรงงาน'),
(5, 'ครุภัณฑ์ยานพาหนะและขนส่ง'),
(6, 'ครุภัณฑ์ไฟฟ้าและวิทยุ'),
(7, 'ครุภัณฑ์โฆษณาและเผยแพร่'),
(8, 'ครุภัณฑ์การเกษตร'),
(9, 'ครุภัณฑ์โรงงาน'),
(10, 'ครุภัณฑ์ก่อสร้าง'),
(11, 'ครุภัณฑ์สำรวจ'),
(12, 'ครุภัณฑ์วิทยาศาตร์การแพทย์'),
(13, 'ครุภัณฑ์คอมพิวเตอร์'),
(14, 'ครุภัณฑ์การศึกษา'),
(15, 'ครุภัณฑ์งานบ้านงานครัว'),
(16, 'ครุภัณฑ์กีฬา'),
(17, 'ครุภัณฑ์ดนตรีและนาฏศิลป์'),
(18, 'ครุภัณฑ์อาวุธ'),
(19, 'ครุภัณฑ์สนาม');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `item`
--
ALTER TABLE `item`
  ADD PRIMARY KEY (`IDs`),
  ADD KEY `Item_fk` (`TypeID`);

--
-- Indexes for table `type`
--
ALTER TABLE `type`
  ADD PRIMARY KEY (`ID`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `item`
--
ALTER TABLE `item`
  MODIFY `IDs` int(3) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=107;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `item`
--
ALTER TABLE `item`
  ADD CONSTRAINT `Item_fk` FOREIGN KEY (`TypeID`) REFERENCES `type` (`ID`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
